# 1. Определите класс Apple с четырьмя переменными экземпляра, представляющими четыре свойства яблока.
class Apple:
    def __init__(self, color, weight, size, count):
        self.color = color
        self.weight = weight
        self.size = size
        self.count = count


apple1 = Apple('yellow', 4, 10, 10)

print(apple1.color)
print(apple1.weight)
print(apple1.size)
print(apple1.count)


exit()


# 2. Создайте класс Circle с методом area, подсчитывающим и возвращающим площадь круга.
# Затем создайте объект Circle, вызовите в нем метод area и выведите результат.
# Воспользуйтесь функцией pi из встроенного в Python модуля math.

from math import pi


class Circle:
    def __init__(self, r):
        self.r = r

    def area(self):
        return self.r ** 2 * pi


cir1 = Circle(10)
print(cir1.area())

exit()

# 3. Создайте класс Triangle с методом area, подсчитывающим и возвращающим площадь треугольника.
# Затем создайте объект Triangle, вызовите в нем area и выведите результат.
class Triangel:

    def __init__(self, a, ha):
        self.a = a
        self.ha = ha

    def area(self):
        return 0.5 * self.a * self.ha


tr1 = Triangel(4, 6)
print(tr1.area())

exit()


# 4. Создайте класс Hexagon с методом calculate_perimeter, подсчитывающим и возвращающим периметр шестиугольника.
# Затем создайте объект Hexagon, вызовите в нем calculate_perimeter и выведите результат.

class Hexagon:
    def __init__(self, a, b, c, d, e, f):
        self.a = a
        self.b = b
        self.c = c
        self.d = d
        self.e = e
        self.f = f

    def calculate_perimeter(self):
        return self.a + self.b + self.c + self.d + self.e + self.f


h1 = Hexagon(4, 5, 6, 3, 4, 5)
print(h1.calculate_perimeter())
